 package lesson1;

public class FirstClass {
    //точка входа
    public static void main(String[] args) {
       System.out.println("SOme info");
       /* // примитивные типы
        //byte (целые числа, 1 байт)
        //Short (целые числа, 2 байта)
        // int (целые числа, 4 байта)
        // long (целые числа, 8 байт)
        // float ( 4 байта)
        // Double (8 байт
        // char (юникод, 2 байта)
        // boolean (логический тип 1 байт)

        //объвление переменной

        //типДанных имяПеременной ;
        // имяПеременной = значение ;

        // типДанных имяПеременной = значение;
        //типДанных имяПеременной1, имяПеременной1, имяПеременной1;

        //целочисленные тпы данных
        byte byteVar;
        short shortVar = 5;
        short shortVar1 = 38;
        int shortVar3 = shortVar + shortVar1;

        int a = 1_000_000;

        int b = 9;
        int c = 5;
        //при делении целыхчисел остаток отбрасывется
        //приделении на 0 получим ошибку
        int res = b / c;

        long longVar = 20000000000L;

        //числа с плавающей  точкой
        float floatVar = 2.3F;
        double doubleVar = 2.3;

        boolean isActive = true;
        boolean started = false;

        //автоматическое преобразование

        int j = 200;
        long k = j;

        // приведение типов
        // не должно ыть больше допустимого переменной long
        long n = 90;
        int m = (int) n;
        // математические операторы
        // + - * / %
        // % остаток от деления

        //инкримент
        int i = 3;
        i++; // увеличивается на единцу
        ++i;
        // декремент
        i--;
        --i;

        // операторы сравнения
        //< > = <= >= !=  для сравнения
        // логические операторы
        // && и
        // (a && b) проверяется первым а посредственно b  если а false b проверятся не будт
        // || или
        //(a||b)
        // ! не
        // (a ^ b) xor true будет равно когда один истенный, а другой ложный

        // операторы присваивания
        // = равно
        // +=  -= *= /= %=
        a = 12;
        //a+= 3 // a= a+3;


        // тернарный оператор
        // переменная а = (условие) ? выражение1 : выражение2;  если условие истено результат выражение1 иначе выражение2
        // (a < b)

        int z = 6;
        int x = 8;
        //int r = (z<x) ? z/x : z+x; //озврощемые значения, должны быть совместимы или одинаковы


        // ссылочные типы

    */
    }
}